#+title: Cyborg Agenda
#+description: An introduction to org mode by creating an org document for information on the superhero Cyborg.

* Weapon Damage Calculator
  

#+NAME: wdc
#+BEGIN_SRC python :results output
  arm_cannon = {"name": "Arm Cannon", "power": 8}
  reinforced_door = {"name": "Reinforced Door", "armor": 3}

  def wdc(weapon, target):
    damage = weapon["power"] - target["armor"]
    if damage<0:
      return 0
    else: 
      return damage

  damage_done = wdc(arm_cannon, reinforced_door)
  print("Using the weapon " + arm_cannon["name"] + " with " + str(arm_cannon["power"]) + " power,")
  print("against the target " + reinforced_door["name"] + " with " + str(reinforced_door["armor"]) + " armor,")
  print("results in " + str(damage_done) + " damage.")
#+END_SRC



#+RESULTS: wdc
: Using the weapon Arm Cannon with 8 power,
: against the target Reinforced Door with 3 armor,
: results in 5 damage.

** Blocks
Blocks are specific chunks of the org document that are used for a variety of purposes. 
Examples are given in a block such as: 

#+begin_example
An Example.
#+end_example


Code fragments can be given in a block such as well. 

#+begin_src python :results output 
  print("This can be done in .org mode");
#+end_src

#+RESULTS:
: This can be done in .org mode

